/**
  * 正则表达式
  */
export const reg_exp = {
  // 价格验证
  price: /^(0|[1-9][0-9]{0,9})(\.[0-9]{1,2})?$/,
  // 手机号
  phone: /^1[34578]\d{9}$/,
  // 邮箱
  // email:/^\w+@[a-z0-9]+(\.[a-z]+){1,3}$/,
  email: /^[a-zA-Z0-9\._-]+@[a-zA-Z0-9_-]+(\.[a-zA-Z0-9_-]+)+$/,

  // 地址
  merchantAddress: /^([\u4e00-\u9fa5]*|[a-zA-Z0-9\._\s]*)+$/,
  // 输入中文，如姓名
  zhCN: /^[\u4e00-\u9fa5]+$/,

  // 公司
  company: /^(([\u4e00-\u9fff]{2,20})|([a-z|\.\s|\,]{2,50}))$/i,
  // qq
  qq: /^[1-9]\d{4,10}$/,
  // 银行卡号
  bankNumber: /^\d{5,30}$/,
  // 验证码
  verifyCode:  /^(?!^\d+$)[0-9a-zA-Z]{4}$/
  //
}
